// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "美丽又漂亮的许美女",  // 同上...
        "今天是你的生日",
        "这是我们认识的",
        "第二个生日了哦",
        "我知道我可能给你留下了",
        "许多不太好的印象",
        "在这里我跟你说一声对不起",
        "当然，你说过你对我没什么感觉",
        "我们也尝试过",
        "毕竟不留遗憾嘛",
        "可是都是以失败告终的",
        "我知道我自己的不足",
        "我也在改变自己",
        "我知道好感要慢慢产生的",
        "不急，",
        "我知道你已经猜出来了",
        "我是谁了",
        "在这里我祝你生日快乐",
        "祝我许大美女越来越漂亮",
        "愿我的祝福萦绕你",
        "在你缤纷的人生之旅",
        "在你飞翔的彩虹天空里祝:",
        "生日快乐！天天好心情！永远靓丽！",
        "我只想对你说：我一直在",
        "只要你需要，我就一直在",
        "最后还是要祝你生日快乐",
        "一直开心",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "美丽漂亮的小仙女": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
